Repository: 84000/data-translation-memory
Catalog: toh1-1-v1.tmx
Source language: bo
Languages: en

source: ཤེས་ལྡན་དག་འདི་གཉིས་སུ་སུ་ཡང་མི་གཞུག་གམ། དེ་དག་གིས་སྨྲས་པ། སུ་ཡང་མི་གཞུག་སྟེ།
en: “Gentlemen , will no one be put into these two?” “No,” they replied.

source: འདི་ལྟར་འཕགས་པ་ཀུན་དགའ་བོའི་སྲིང་མོའི་བུ་གཉིས་རབ་ཏུ་བྱུང་ནས་
en: “For the two sons of noble Ānanda’s sister have gone forth and yet lazily pass their time.

source: ལེ་ལོས་འདའ་བར་བྱེད་པ་དེ་གཉིས་ཤི་ཞིང་དུས་ལ་བབ་ན་འདིར་སྐྱེ་བར་འགྱུར་བས་དེ་གཉིས་ཀྱི་དོན་དུ་བཞག་གོ། །
en: When their time has come and they die, they will be reborn here, so these two vats have been reserved for them.”

source: དེ་གཉིས་ཤིན་ཏུ་སྐྲག་ནས་གལ་ཏེ་ཤེས་ན་དེང་ཉིད་དུ་བཅུག་པར་འོང་ངོ་སྙམ་ནས་
en: Terrified, they thought, “If we’re recognized, they’ll put us in those vats this very day,”

source: ཕྱོགས་བཞིར་རྣམ་པར་བལྟ་བར་བརྩམས་ནས།
en: and began to look all about them.

source: དེ་གཉིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོའི་གན་དུ་དོང་བ་དང་། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་སྨྲས་པ།
en: They went to Mahāmaudgalyāyana, who asked,

source: ཁྱེད་ཀྱིས་མཐོང་ངམ། འཕགས་པ་མཐོང་ངོ་། །
en: “Did you see something?” “Noble one, we did.”

source: དེ་ན་ཅི་ཡོད། སེམས་ཅན་དམྱལ་བ་དག་མཆིས་སོ། །
en: “What?” “Beings in the hell realms.”

source: དེ་ན་ཅི་བྱེད།
en: “What were they doing there?”

source: དེ་གཉིས་ཀྱིས་སྨྲས་པ། གཅོད་པ་དང་། འཚེག་པ་དང་། རྡུང་བ་དང་། འདྲལ་བ་ལ་སོགས་པའི་ལས་དག་བགྱིད་ཅིང་
en: “They were doing all sorts of things—cutting, slicing, crushing, hacking to pieces,”

source: མཆིས་པ་མཐོང་ནས་བདག་ཅག་གིས་ཤེས་
en: When we saw two boiling iron vats standing empty, we asked,

source: ལྡན་དག་འདི་གཉིས་སུ་སུ་ཡང་མི་གཞུག་གམ་ཞེས་བགྱིས་ན། དེ་དག་གི་མཆིད་ནས་སུ་ཡང་མི་གཞུག་སྟེ།
en: ‘Gentlemen , will no one be put into these two?’ And they replied, ‘No.

source: ལེ་ལོས་འདའ་བར་བྱེད་པ་དེ་གཉིས་ཤི་ཞིང་དུས་ལ་བབ་ན་འདིར་སྐྱེ་བར་འགྱུར་བས་དེ་གཉིས་ཀྱི་དོན་དུ་བཞག་གོ་ཞེས་མཆིའོ། །
en: When their time has come and they die, they’ll be reborn here, so these two have been reserved for them.’

source: དགེ་ཚུལ་གཉིས་དེ་ལྟར་ན་ཉེས་དམིགས་འདི་དག་དང་།
en: Then Mahāmaudgalyāyana advised, “Thus, novices, knowing that disadvantages such as these,

source: གཞན་དག་ཀྱང་ལེ་ལོས་འབྱུང་བར་འགྱུར་བས་བརྩོན་འགྲུས་གྱིས་ཤིག །
en: and others too, accrue from laziness, apply yourselves diligently.”

source: དེ་གཉིས་བརྩོན་འགྲུས་རྩོམ་པ་བཀླག་པར་བྱ་བར་བརྩམས་ཤིང་།
en: The two nephews began to apply themselves to their studies with diligence.

source: གལ་ཏེ་སྔ་དྲོ་སེམས་ཅན་དམྱལ་བ་དྲན་ན་ནི་
en: If they thought of the beings in the hell realms in the morning,

source: ཟན་ཟ་བར་ཡང་མི་བྱེད་ལ། གལ་ཏེ་ཕྱི་དྲོ་དྲན་ན་ནི་ཟས་དེ་སྐྱུག་པར་འགྱུར་བས་
en: they would not even eat; if they thought of them in the afternoon, they would vomit up what they had eaten.

source: དེ་གཉིས་སྐྱ་བོ་བསེང་བསེང་པོ་རིད་པ་དང་། ཉམ་ཆུང་བ་དང་། རྐེ་བ་དང་། སྐམ་པ་དང་། ལུས་མ་ཐོབ་པར་གྱུར་ནས་དེས་སྨྲས་པ།
en: Thus it was that the two of them became pallid, emaciated, feeble, withered, thin, and weak. Mahāmaudgalyāyana said,

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དེ་གཉིས་ཡིད་བྱུང་བར་བྱས་ཟིན་ཏོ།
en: “Ānanda, the two have become dispirited.”

source: གནས་བརྟན་ད་ནི་གཟེངས་སྟོད་ཅིག
en: “Elder, now they must be inspired.”

source: ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་དེ་གཉིས་ལ་སྨྲས་པ། དགེ་ཚུལ་གཉིས་ཉིན་མོ་སྤྱོད་དུ་འདོང་ངོ་། །དེ་གཉིས་ཀྱིས་སྨྲས་པ། འཕགས་པ་བཞུད་དེ། །
en: Mahāmaudgalyāyana said to the two, “Novices, let’s go for our daily practice.” “Noble one,” they replied,

source: ཕྱོགས་གཞན་དུ་བཞུད་ཀྱི་དེར་ནི་མི་བཞུད་དོ། །སྟན་ཁྱེར་ཅིག །
en: “we will go, but we will not return to that one place.” “Bring something to sit on.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་དེ་གཉིས་ཁྲིད་ནས་ཉིན་མོ་སྤྱོད་དུ་སོང་ངོ་།
en: Mahāmaudgalyāyana then took the two novices for their daily practice.

source: དེ་ན་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་ཕྱོགས་གཅིག་ཅིག་ཏུ་ལྷ་དག་སྤྲུལ་ཏེ། །
en: On the way, Mahāmaudgalyāyana conjured up an apparition of the gods,

source: དེ་ན་པི་བང་དང་། འོད་མ་དང་། བལ་ལ་རི་དང་། མ་ཧ་ཏི་དང་། སུ་གྷོ་ཥ་ཀ་དག་གི་སྒྲ་དག་གྲག་གོ། །དེ་གཉིས་ཀྱིས་སྨྲས་པ། །
en: along with the sounds of the vīṇā, ektara, balari, mahāti, and the sughoṣak. The two boys exclaimed,

source: འཕགས་པ་འདི་ཅི་ལགས། དེས་སྨྲས་པ། དེང་ལ་ལྟོས་ཤིག
en: “Noble one, what is this?” “Have a closer look,” he replied.

source: དེ་གཉིས་དེར་དོང་བ་དང་། ཇི་ཙམ་ན་པི་བང་དང་། འོད་མ་དང་། བལ་ལ་རི་དང་། མ་ཧ་ཏི་དང་།
en: The two of them approached and followed the sounds of the vīṇā, ektara, balari, mahāti,

source: སུ་གྷོ་ཥ་ཀ་དག་གི་སྒྲ་དག་སྒྲོགས་ཤིང་དེ་ན་གཞལ་མེད་ཁང་མལ་ཆ་དང་སྟན་བཤམས་པ་ལྷའི་བུ་མོ་དག་གིས་ཡོངས་སུ་གང་བ་གཉིས་ཤིག་ཡོད་དེ། །
en: and the sughoṣak to where there stood two palaces strewn with beds and divans replete with goddesses.

source: དེ་གཉིས་ན་ལྷའི་བུ་སུ་ཡང་མི་འདུག་པ་མཐོང་ནས་དེ་གཉིས་ཀྱིས་སྨྲས་པ།
en: Seeing no gods in either palace, they inquired,

source: ཤེས་ལྡན་དག་ཅིའི་ཕྱིར་གཞལ་མེད་ཁང་འདི་གཉིས་ན་ལྷའི་བུ་སུ་ཡང་མི་འདུག །
en: “Mistresses , are there no gods in either of these palaces?”

source: དེ་དག་གིས་སྨྲས་པ། སུ་ཡང་མི་འདུག་གོ། །ཅིའི་ཕྱིར།
en: “No, there are none.” “Why is that?”

source: འཕགས་པ་ཀུན་དགའ་བོའི་སྲིང་མོའི་བུ་གཉིས་རབ་ཏུ་བྱུང་ནས་བརྩོན་འགྲུས་བརྩམས་ཤིང་སྤྱོད་པ་དེ་
en: “The two sons of noble Ānanda’s sister have gone forth, and since they act and apply themselves diligently,

source: གཉིས་ཤི་ཞིང་དུས་ལ་བབ་ན་འདིར་སྐྱེ་བར་འགྱུར་བས་དེ་གཉིས་ཀྱི་དོན་དུ་བཞག་གོ། །
en: when their time has come and they die, they will be reborn here, so these two have been reserved for them.”

source: དེ་གཉིས་ཡོངས་སུ་དགའ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོའི་གན་དུ་དོང་བ་དང་།
en: Overjoyed, they went to Mahāmaudgalyāyana,

source: དེ་ན་ཅི་ཡོད། ལྷ་དག་མཆིས་སོ། །
en: “What?” “Gods.”

source: པི་བང་དང་། འོད་མ་དང་། བལ་ལ་རི་དང་། མ་ཧ་ཏི་དང་། སུ་གྷོ་ཥ་ཀ་དག་གི་སྒྲ་དག་སྒྲོགས་ཤིང་དེ་ན་གཞལ་མེད་ཁང་མལ་ཆ་དང་སྟན་བཤམས་པ་ལྷའི་བུ་མོ་དག་གིས་ཡོངས་སུ་གང་བ་གཉིས་ཤིག་མཆིས་ཏེ།
en: “We could hear the sounds of the vīṇā, ektara, balari, mahāti, and the sughoṣak, and found two palaces strewn with beds and divans replete with goddesses,

source: དེ་གཉིས་བརྩོན་འགྲུས་རྩོམ་པས་བཀླག་པར་བྱ་བར་བརྩམས་ཏེ་ལུང་ནོད་པ་དང་། ཇི་ཙམ་ན་གླེང་གཞི་དང་། ཡང་དག་པར་ལྡན་པའི་རྒྱུད་དུ་གཏོགས་པ་ལས།
en: The two of them began to apply themselves to their studies and receive instructions. After a time, they came across the following passage in the Nidānasaṃyukta

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱག་གི་སེན་མོའི་རྩེ་མོས་རྡུལ་དག་བཞེས་ནས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: Then, taking dirt from the tip of his fingernail, the Blessed One asked the monks,

source: དགེ་སློང་དག་ཇི་སྙམ་དུ་སེམས། ངས་སེན་མོའི་རྩེ་མོས་རྡུལ་དག་བླངས་པ་གང་དག་ཡིན་པ་དང་། ས་ལ་གནས་པའི་རྡུལ་གང་དག་ཡིན་པ་དེ་དག་གང་མང་སྙམ། །
en: “Monks, what do you think? Which is more, the dirt I take from the tip of my fingernail or the dirt that is upon this earth?”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱག་གི་སེན་མོའི་རྩེ་མོས་རྡུལ་དག་བཞེས་པ་གང་དག་ལགས་པ་དེ་དག་ནི་ཉུང་བ་དང་།
en: “Reverend, the dirt the Blessed One takes from the tip of his fingernail is less,

source: ཉུང་ངུ་དང་། ཉུང་ཤས་དང་། ཉུང་ཟད་ལགས་ཏེ།
en: much less, a great deal less, entirely less.

source: དེ་དག་དོགས་ལ་གནས་པའི་རྡུལ་དག་དང་བསྐྲུན་ན་
en: If we used those specks to produce all the dirt on the earth,

source: བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་མཆི། སྟོང་གི་ཆ་དང་། བརྒྱ་སྟོང་གི་ཆ་དང་།
en: it would not amount to even one hundredth, it would not amount to one thousandth of it, or one hundred thousandth of it;

source: གྲངས་དང་། ཆ་དང་། བགྲང་བ་དང་། དཔེ་དང་། རྒྱུར་ཡང་ཉེ་བར་མི་མཆིའོ། །
en: it would not equal, match, number, compare to, or cause it.”

source: ས་ལ་གནས་པའི་རྡུལ་དག་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་སེམས་ཅན་དག་ནི་
en: “sentient beings equal in number to the particles of dirt on the earth

source: སེམས་ཅན་དམྱལ་བ་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་སེམས་ཅན་དམྱལ་བ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་གྱི།
en: die among hell realm beings only to be reborn among hell realm beings,

source: སེན་མོའི་རྩེ་མོ་ལ་གནས་པའི་རྡུལ་དག་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་སེམས་ཅན་དག་ནི་སེམས་ཅན་དམྱལ་བ་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་
en: while sentient beings equal in number only to the particles of dirt on the tip of my fingernail die among hell realm beings

source: མི་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: and are reborn among humans.

source: སེམས་ཅན་དམྱལ་བ་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་དུད་འགྲོ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་གྱི།
en: die among hell realm beings only to be reborn among animals,

source: སེམས་ཅན་དམྱལ་བ་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་མི་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: die among hell realm beings only to be reborn among spirits,

source: ཡི་དགས་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་གྱི།
en: and are reborn among gods.

source: སེན་མོའི་རྩེ་མོ་ལ་གནས་པའི་རྡུལ་དག་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་སེམས་ཅན་དག་ནི་
en: while sentient beings equal in number only to the particles of dirt on the tip of my fingernail

source: ས་ལ་གནས་པས་རྡུལ་དག་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་སེམས་ཅན་དག་ནི་
en: “Sentient beings equal in number to the particles of dirt on the earth

source: སེམས་ཅན་དམྱལ་བ་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་ཡི་དགས་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་གྱི།
en: die among hell realm beings only to be reborn among spirits,

source: སེམས་ཅན་དམྱལ་བ་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་རོ། །
en: die among hell realm beings and are reborn among gods.

source: དུད་འགྲོ་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་དུད་འགྲོ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་གྱི།
en: die among animals only to be reborn among animals,

source: དུད་འགྲོ་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་མི་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: die among animals and are reborn among humans.

source: དུད་འགྲོ་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་སེམས་ཅན་དམྱལ་བ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་གྱི།
en: die among animals only to be reborn among hell realm beings,

source: དུད་འགྲོ་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: die among animals and are reborn among gods.

source: དུད་འགྲོ་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་ཡི་དགས་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་གྱི།
en: die among animals only to be reborn among spirits,

source: དུད་འགྲོ་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་རོ། །
en: die among animals and are reborn among gods.

source: ཡི་དགས་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་ཡི་དགས་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་གྱི།
en: die among spirits only to be reborn among spirits,

source: ཡི་དགས་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་མི་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: die among spirits and are reborn among humans.

source: ཡི་དགས་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་སེམས་ཅན་དམྱལ་བ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་གྱི།
en: die among spirits only to be reborn among hell realm beings,

source: ཡི་དགས་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་དུད་འགྲོ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་གྱི།
en: die among spirits only to be reborn among animals,

source: ཡི་དགས་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: die among spirits and are reborn among gods.

source: ཡི་དགས་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་རོ། །
en: die among spirits and are reborn among gods.

source: ལྷ་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་སེམས་ཅན་དམྱལ་བ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་གྱི།
en: die among gods only to be reborn among hell realm beings,

source: ལྷ་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: die among gods and are reborn among gods.

source: ལྷ་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་དུད་འགྲོ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་གྱི།
en: die among gods only to be reborn among animals,

source: ལྷ་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་ཡི་དགས་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་གྱི།
en: die among gods only to be reborn among spirits,

source: མི་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་སེམས་ཅན་དམྱལ་བ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་གྱི།
en: die among humans only to be reborn among hell realm beings,

source: མི་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་མི་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: die among humans and are reborn among humans.

source: མི་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་དུད་འགྲོ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་གྱི། །
en: die among humans only to be reborn among animals,

source: མི་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་ཡི་དགས་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་གྱི།
en: die among humans only to be reborn among spirits,

source: མི་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་མི་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་རོ། །
en: die among humans and are reborn among humans.

source: ཞེས་གསུངས་པ་འཁོར་ལོ་བཞིན་དུ་སྦྱར་བ་བླགས་པ་དང་། དེ་གཉིས་ཀྱིས་སྨྲས་པ།
en: Upon reading this chapter, called “Repeating Like a Wheel,” the two boys asked Mahāmaudgalyāyana,

source: འཕགས་པ་བདག་ཅག་གིས་ཀྱང་ལྷ་དང་མི་རྣམས་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོ་དང་། ཡི་དགས་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་བགྱིའམ།
en: “Noble one, will we too die among gods and humans only to be reborn among hell realm beings, animals, and spirits?”

source: དེས་སྨྲས་པ། བཞིན་བཟངས་གཉིས་འགྲོ་བ་ལྔ་པའི་འཁོར་བར་ཇི་སྲིད་དུ་ཉོན་མོངས་པ་རྣམས་རྒྱུན་ཆད་པར་མ་གྱུར་པ་དེ་སྲིད་དུ་ཟོ་ཆུན་རྒྱུད་མོའི་ཚུལ་གྱིས་ཡོངས་སུ་འཁོར་བར་བྱ་དགོས་སོ། །
en: “Gentlemen , so long as the continuum of disturbing emotions remains uninterrupted, you must spin like a waterwheel through the cycle of five migrations.”

source: དེ་གཉིས་ཡིད་བྱུང་ནས་ཚིགས་སུ་བཅད་པ་སྨྲས་པ།
en: Disheartened, they spoke this verse:

source: གང་ཕྱིར་མི་གནས་ལྷ་རྣམས་མི་བཟང་སྟེ། །འཚོ་བ་ཐུང་བའི་མི་རྣམས་མི་བཟང་ངོ་། །
en: “Being a god, who cannot stay a god, is no good. Being a human, whose life is short, is no good.

source: གང་ན་ཞི་མེད་སྲིད་པ་མི་བཟང་སྟེ། །མྱ་ངན་འདས་པ་མཆོག་ཅེས་བདེ་གཤེགས་གསུང་། །
en: Being in saṃsāra, where there is no peace, is no good. That is why, said the Sugata, nirvāṇa is supreme.

source: འཕགས་པ་ཅི་ནས་ཀྱང་བདག་ཅག་འཁོར་བར་འཁོར་བ་ན་སླན་ཆད་ཉོན་མོངས་པ་དེ་ལྟ་བུ་དག་ཀུན་དུ་སྤྱོད་པར་མི་འགྱུར་བ་དེ་ལྟར་བདག་ཅག་ལ་ཆོས་བསྟན་དུ་གསོལ།
en: “Noble one, henceforth, come what may, as we cycle through saṃsāra we must avoid engaging with such disturbing emotions, so please, we ask that you teach us the Dharma.”

source: ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་དེ་གཉིས་ཀྱི་བསམ་པ་དང་། བག་ལ་ཉལ་བ་དང་། ཁམས་དང་། རང་བཞིན་ཁོང་དུ་ཆུད་ནས་
en: Mahāmaudgalyāyana knew their thoughts, their tendencies, their characters, and their natures.

source: གང་ཐོས་ནས་དེ་གཉིས་ཀྱིས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པས་དགྲ་བཅོམ་པ་ཉིད་མངོན་དུ་བྱས་ཏེ།
en: Drawing on all he had heard, he taught them the Dharma so that they abandoned all disturbing emotions and actualized arhatship,

source: དགྲ་བཅོམ་པ་ཁམས་གསུམ་པ་ལས་འདོད་ཆགས་དང་བྲལ་བ། བོང་བ་དང་གསེར་དུ་མཉམ་པ།
en: becoming arhats free of attachment to the three realms, for whom filth was equal to gold,

source: ནམ་མཁའ་དང་ལག་མཐིལ་དུ་མཚུངས་པའི་སེམས་དང་ལྡན་པ། ཙན་དན་དང་སྟེའུར་མཉམ་པ།
en: who knew space like the palm of their hands, whose emotions had been cooled as if treated by a balm of sandalwood,

source: རིག་པས་སྒོ་ངའི་སྦུབས་དྲལ་བར་གྱུར་ཅིང་། རིག་པ་དང་། མངོན་པར་ཤེས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ།
en: whose knowledge had rent open the shell. They attained knowledge, clairvoyance, and discerning wisdom.

source: སྲིད་པ་དང་། འདོད་པའི་རྙེད་པ་དང་། བཀུར་སྟི་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ། དབང་པོ་དང་ཉེ་དབང་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་མཆོད་པར་བྱ་བ་དང་། རྗེད་པར་བྱ་བ་དང་། མངོན་དུ་སྨྲ་བར་བྱ་བར་གྱུར་པ་དེ་ལྟ་བུའི་ཆོས་བསྟན་པ་བྱས་སོ། །
en: They turned their backs on worldly gain, desires, and esteem and were revered, honored, and praised by Indra and the gods who attend him.

source: དེ་གཉིས་རྫུ་འཕྲུལ་གྱིས་སྟེང་གི་ནམ་མཁའ་ལ་མེ་ཏོག་དག་ཐུ་ཞིང་འདོང་བ་དགེ་སློང་རྣམས་ཀྱིས་མཐོང་ནས་དེ་དག་གིས་སྨྲས་པ།
en: When the monks saw the two novices miraculously flying through the air, picking flowers, they asked one another,

source: ཚེ་དང་ལྡན་པ་དག་འདི་གཉིས་གང་དག་ཡིན། ཆེ་གེ་མོ་དང་ཆེ་གེ་མོ་ཡིན་ནོ། །
en: “Venerables, who are those two?” One said, “They are the two novices, kin to Ānanda.”

source: དེ་དག་གིས་སྨྲས་པ། བདག་ཅག་ལྷུང་བཟེད་ནག་པོར་ཟོས་ནས་
en: “Our begging bowls are black with wear.

source: སོ་དག་ལྷུང་ཞིང་མགོ་སྐྱ་བོར་གྱུར་ཀྱང་བདག་ཅག་གིས་སེམས་རྩེ་གཅིག་པ་ཡང་མ་ཐོབ་ན།
en: Our teeth are falling out and our hair turns grey, and yet we have not achieved even stillness of mind.

source: ཚེ་དང་ལྡན་པ་འདི་གཉིས་དང་པོ་ལོ་བདུན་ཁོ་ན་ལོན་ཏེ་རབ་ཏུ་བྱུང་ན་
en: Venerable, if these two were but seven years old when they went forth

source: ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པས་དགྲ་བཅོམ་པ་ཉིད་མངོན་དུ་བྱས་པས་
en: and yet abandoned all disturbing emotions and actualized arhatship,

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀུན་དགའ་བོ་བརྩོན་འགྲུས་ཀྱིས་བྱང་ཆུབ་འཐོབ་བོ་ཞེས་བཀའ་སྩལ་པ་དེ་ནི་ལེགས་པར་གསུངས་པ་ཡིན་ནོ། །
en: then the Blessed One spoke well when he said, ‘Ānanda, awakening is attained through diligence.’

source: དགེ་སློང་རྣམས་ཐེ་ཚོམ་སྐྱེས་ནས་ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ།
en: In doubt, the monks went to he who severs all doubts, the Blessed Buddha, and asked,

source: བཙུན་པ་དགེ་ཚུལ་འདི་གཉིས་ཀྱིས་ལས་ཅི་ཞིག་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ལོ་བདུན་ཁོ་ན་ལགས་ན་རབ་ཏུ་བྱུང་སྟེ།
en: “Reverend, what actions have these two novices done that the fruition of such an act should lead them to go forth at the mere age of seven,

source: བཅོམ་ལྡན་འདས་ཀྱིས་འདུལ་བ་ལ་ཉན་ཐོས་རྣམས་ཀྱི་བསླབ་པའི་གཞི་བཅའ་བ་མཛད་པ་གང་ལགས་པ་དེ་འདི་གཉིས་ཁོ་ན་ལ་བརྟེན་ནས་
en: and that the Blessed One exempted them alone from the vinaya guidelines he laid down for his disciples,

source: བག་ཡངས་སུ་མཛད་ཅིང་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པས་དགྲ་བཅོམ་པ་ཉིད་མངོན་དུ་བགྱིས།
en: allowing them to abandon all disturbing emotions and actualize arhatship?”

source: དགེ་སློང་དག་འདི་གཉིས་ཉིད་ཀྱིས་ལས་ཚོགས་རྙེད་པ། རྐྱེན་ཡོངས་སུ་བསྒྱུར་བ།
en: “Monks, these two themselves performed the actions—which have accrued a heap of karma, whose results have matured,

source: འོད་པ་བཞིན་དུ་ཉེ་བར་གནས་པ། གདོན་མི་ཟ་བར་འབྱུང་བར་འགྱུར་བ་དག་བྱས་ཤིང་
en: which follow their course like an irrigation channel, which inevitably come to be

source: བསགས་པས་འདི་གཉིས་ཉིད་ཀྱིས་ལས་བྱས་ཤིང་བསགས་པ་དག་གཞན་སུ་ཞིག་གིས་སོ་སོར་མྱོང་བར་འགྱུར།
en: o who else will experience the actions they theselves have performed and accrued?

source: འདི་ལྟར་ལས་དགེ་བ་དང་མི་དགེ་བ་བྱས་ཤིང་བསགས་པ་དག་ནི་ཟིན་པའི་ཕུང་པོ་དང་ཁམས་དང་།
en: Likewise, virtuous and non-virtuous actions which have been performed and accrued come to fruition upon the aggregates, elements,

source: སྐྱེ་མཆེད་དག་ལ་རྣམ་པར་སྨིན་པར་འགྱུར་ཏེ། །
en: and seats of the senses of the one who performed them, for:

source: ལས་རྣམས་བསྐལ་པ་བརྒྱར་ཡང་ནི། །ཆུད་མི་ཟ་བའང་ཚོགས་དང་དུས།
en: “Actions never waste away, Not even after one hundred eons.

source: སྟོན་པ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་།
en: a teacher, a tathāgata, an arhat, a perfectly awakened buddha,

source: ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ།
en: a knowledgeable and venerable one, a sugata, one who knew the world,

source: སྐྱེས་བུ་གདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: an unsurpassed guide who tamed beings, a teacher to gods and men,

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: the Blessed Buddha Kāśyapa.

source: དེ་དགེ་སློང་གི་འཁོར་ཉི་ཁྲི་དང་བཱ་རཱ་ཎ་སཱི་ན་དྲང་སྲོང་སྨྲ་བ་རི་དགས་ཀྱི་ནགས་ན་ཉེ་བར་རྟེན་ཅིང་བཞུགས་སོ། །
en: “With his following of twenty thousand monks, he lived and stayed in the Deer Park of Ṛṣipatana near Vārāṇasī.

source: བཱ་རཱ་ཎ་སཱི་ན་ཁྱིམ་བདག་ཕན་ཚུན་བཤེས་པ་གཉིས་ཤིག་གཞོན་ནུའི་གནས་སྐབས་སུ་རབ་ཏུ་འབྱུང་བར་འདོད་ན་
en: In Vārāṇasī there lived two householders and friends, who had wished to go forth in their youth,

source: དེ་གཉིས་ཀྱིས་ཉེ་དུ་དག་ལས་རབ་ཏུ་འབྱུང་བ་མ་ཐོབ་ནས།
en: but had not received leave to go forth from their relatives.

source: གང་གི་ཚེ་ལང་ཚོ་ཡོལ་བར་གྱུར་པ་དེའི་ཚེ་ན་དེ་གཉིས་ཀྱིས་ཉེ་དུ་དག་ལ་བལྟས་ཏེ་ཡང་དག་ པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ངོ་། །
en: At a certain point, after their youth had faded, they abdicated in favor of their relatives and went forth into the teachings of the perfectly awakened Buddha Kāśyapa.

source: འདི་ནི་ཆོས་ཉིད་དེ་རྟག་ཏུ་གཞོན་རིམ་གྱིས་ལས་བྱ་བ་ཡིན་པས་
en: As was natural given their junior status, they were always expected to perform errands,

source: དགེ་སློང་རྣམས་ཀྱིས་རྒན་ཞུགས་འདི་གཉིས་དེང་ཤིག །
en: and so the monks would order them about, saying,

source: རྒན་ཞུགས་འདི་གཉིས་ཁྱེད་ཅིག་ཅེས་བསྒོའོ།
en: ‘You two retired devotees! Go do this!’

source: དེ་ན་གཅིག་ནི་སྤྲོ་རིང་བའི་རང་བཞིན་ཅན་ཡིན། ཅིག་ཤོས་ནི་སྤྲོ་ཐུང་བའི་རང་བཞིན་ཅན་ཡིན་པས་དེ་
en: and ‘You two retired devotees! Bring me that!’“One of them had a placid nature but the other was quick-tempered.

source: ཁྲོ་བར་བྱེད་པ་དང་ཅིག་ཤོས་ཀྱིས་སྨྲས་པ། རྒན་ཞུགས་གཞོན་པའི་གནས་སྐབས་སུ་རབ་ཏུ་མ་བྱུང་ན་ད་ཅིའི་ཕྱིར་ཁྲོ། །
en: Thus when the one became angry, the other would say, ‘Retired devotee, if you couldn’t go forth when you were young, why get angry now?’“

source: དེ་ན་འདི་གཉིས་ཀྱི་ཚེ་ཇི་སྲིད་བར་ཚངས་པར་སྤྱོད་པ་སྤྱད་ན་
en: “Though they lived the holy life for the remainder of their lives,

source: ཡོན་ཏན་གྱི་ཚོགས་འགའ་ཡང་མ་ཐོབ་ནས་དེའི་འོག་ཏུ་འཆི་བའི་ཚེ་སྨོན་ལམ་འདི་སྐད་ཅེས།
en: they did not achieve any of the host of qualities. So later, as they died, they said this prayer:

source: བདག་ཅག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོན་གནས་བླ་ན་མེད་པ་འོད་སྲུང་ལ་ཚེ་ཇི་སྲིད་བར་ཚངས་པར་སྤྱོད་པ་སྤྱད་ན་
en: ‘We have lived the holy life for what remained of our lives under the Blessed One, the tathāgata, the arhat, the perfectly awakened Buddha, the hallowed and unsurpassed Kāśyapa,

source: བདག་ཅག་གིས་ཚེ་ཇི་སྲིད་བར་ཚངས་པར་སྤྱོད་པ་སྤྱད་པའི་དགེ་བའི་རྩ་བ་འདིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་
en: Therefore, may the roots of virtue from having lived the holy life for what remained of our lives ensure that at the mere age of seven we go forth into the teachings of the Blessed Buddha Śākyamuni,

source: བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལ་བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་མ་འོངས་པའི་དུས་ན་སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱ་ཐུབ་པ་ན་
en: “In the future, when the lifespans of beings last one hundred years,

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས།
en: will become the tathāgata, the arhat, the perfectly awakened Buddha,

source: སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་
en: he unsurpassed guide who tames beings, the teacher to gods and men, the Blessed Buddha Śākyamuni.”

source: དགེ་སློང་དག་དེ་ལ་དེའི་ཚེ་དེའི་དུས་ན་ཁྱིམ་བདག་གཉིས་གང་དག་ཡིན་པ་དེ་དག་ནི་དགེ་ཚུལ་འདི་གཉིས་ཡིན་ཏེ།
en: “Monks, the two householders of that time are now these two novices.

source: དེ་གཉིས་ཀྱིས་དེར་སྨོན་ལམ་བཏབ་པ་གང་ཡིན་པ་དེས་ད་ལྟར་ལོ་བདུན་ཁོ་ན་ལོན་ནས་རབ་ཏུ་བྱུང་སྟེ།
en: And due to the prayer that they made, they have gone forth at the mere age of seven,

source: ངས་འདུལ་བ་ལ་ཉན་ཐོས་རྣམས་ཀྱི་བསླབ་པའི་གཞི་བཅས་པ་གང་ཡིན་པ་འདི་གཉིས་ཁོ་ན་ལ་བརྟེན་ནས་
en: and I have exempted them alone from the vinaya guidelines I laid down for my disciples,

source: བག་ཡངས་སུ་བྱས་ཤིང་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པས་དགྲ་བཅོམ་པ་ཉིད་མངོན་དུ་བྱས་སོ། །
en: allowing them to abandon all disturbing emotions and actualize arhatship.”

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཡུལ་ཀ་ཤི་དག་ཏུ་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་ན་ཕྱོགས་གཅིག་ཅིག་ཏུ་བྱོན་པ་དང་འཛུམ་པ་མཛད་དོ། །
en: While the Blessed Buddha was journeying and passing through Kāśī, he arrived at a place and smiled.

source: ཆོས་ཉིད་ཀྱིས་ན་གང་གི་ཚེ།
en: As is natural,

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འཛུམ་པ་མཛད་པ་དེའི་ཚེ་ན་ཞལ་ནས་འོད་ཟེར་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། བཙོད་ཀ་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་དག་བྱུང་ནས་ཁ་ཅིག་ནི་འོག་ལོགས་སུ་འདོང་།
en: when blessed buddhas smile, blue, yellow, red, white, maroon, crystalline, and silvery rays of light emerge from their mouths, some streaming downwards and some streaming upwards.

source: ཁ་ཅིག་ནི་སྟེང་ལོགས་སུ་འདོང་བས་གང་དག་འོག་ལོགས་སུ་འདོང་བ་དེ་དག་ནི་སེམས་ཅན་དམྱལ་བ་ཡང་སོས་དང་།
en: Those that streamed downwards proceeded to the hell realms of Sañjīva,

source: ཐིག་ནག་དང་། བསྡུས་གཞོམ་དང་། ངུ་འབོད་དང་། ངུ་འབོད་ཆེན་པོ་དང་། ཚ་བ་དང་། རབ་ཏུ་ཚ་བ་དང་། མནར་མེད་པ་དང་། ཆུ་བུར་ཅན་དང་། །
en: Kālasūtra, Saṅghāta, Raurava, Mahāraurava, Tapana, Pratāpana, Avīci, Arbuda,

source: པད་མ་ལྟར་གས་པ་དང་། པད་མ་ལྟར་གས་པ་ཆེན་པོར་དོང་སྟེ།
en: Padma, and Mahāpadma.

source: སེམས་ཅན་དམྱལ་བ་ཚ་བ་གང་དག་ཡིན་པ་དེ་དག་ཏུ་བསིལ་བར་གྱུར་ཏེ་འབབ་པར་བྱེད་ལ།
en: Alighting on and cooling those in the hot hells and alighting on and

source: སེམས་ཅན་དམྱལ་བ་གྲང་བ་གང་དག་ཡིན་པ་དེ་དག་ཏུ་ནི་དྲོ་བར་གྱུར་ཏེ་འབབ་པར་བྱེད་དོ། །
en: warming those in the cold hells,

source: དེ་དག་དད་པ་བསྐྱེད་པར་བྱ་བའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱིས་སྤྲུལ་པ་གཏོང་བར་མཛད་དེ།
en: To engender faith in them, the Blessed One sent an emanation which,
